# 演習２（やや高難易度のため、授業では解説しません）
#         ※空き時間や復習用に用意しています
#
# 演習１のプログラムを派生させて、
# 小文字のアルファベットの文字列を３種類入力してもらい、
# その「３種類のすべての文字列に共通するすべてのアルファベット」と、
# 「３種類のいずれかの文字列に含まれるすべてのアルファベット」を
# 「アルファベット順に」表示するプログラムを作成して下さい。
#
# なお、入力は小文字のアルファベットで入力されるものとし、
# 入力チェックなどは不要とします。
# 出力時のカッコの形も自由とします。
#
# 入出力例
# 小文字のアルファベットで文字列を３つ入力してください。
# １つめの文字列：abcde
# ２つめの文字列：aiueo
# ３つめの文字列：iroha
# 共通する文字は['a']です。
# いずれかに含まれる文字は['a', 'b', 'c', 'd', 'e', 'h', 'i', 'o', 'r', 'u']です。

# 入力を促すメッセージを表示
print('アルファベットで文字列を入力してください。')




